youseetoo/uc2-esp32/main/src/scanner/HighSpeedScannerCore.cpp
    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    config_ = config;
    buildLineProfile();
    config_changed_ = true;  // Signal task to restart with new config
    xSemaphoreGive(config_mutex_);

    SCANNER_LOG("Config applied successfully, line_len=%d, bidirectional=%d", line_len_, config.bidirectional);
    return true;
}

bool HighSpeedScannerCore::setArbitraryPoints(const ArbitraryScanPoint* points, uint16_t count)
{
    if (!points || count == 0 || count > SCANNER_MAX_ARBITRARY_POINTS) {
        SCANNER_LOG("ERROR: Invalid point count %d (max %d)", count, SCANNER_MAX_ARBITRARY_POINTS);
        return false;
    }

    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    
    // Copy points to internal buffer
    for (uint16_t i = 0; i < count; ++i) {
        arbitrary_points_[i] = points[i];
        
        // Clamp coordinates to 12-bit range
        if (arbitrary_points_[i].x > 4095) arbitrary_points_[i].x = 4095;
        if (arbitrary_points_[i].y > 4095) arbitrary_points_[i].y = 4095;
    }
    
    arbitrary_point_count_ = count;
    config_changed_ = true;  // Signal task to restart with new config
    
    xSemaphoreGive(config_mutex_);

    SCANNER_LOG("Arbitrary points loaded: %d points", count);
    return true;
}

void HighSpeedScannerCore::setScanMode(ScanMode mode)
{
    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    scan_mode_ = mode;
    config_changed_ = true;
    xSemaphoreGive(config_mutex_);
    
    SCANNER_LOG("Scan mode set to %s", (mode == SCAN_MODE_RASTER) ? "RASTER" : "ARBITRARY");
}

void HighSpeedScannerCore::setTriggerMode(TriggerMode mode)
{
    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    trigger_mode_ = mode;
    xSemaphoreGive(config_mutex_);
    
    const char* mode_str = "UNKNOWN";
    switch (mode) {
        case TRIGGER_AUTO: mode_str = "AUTO"; break;
        case TRIGGER_HIGH: mode_str = "HIGH"; break;
        case TRIGGER_LOW: mode_str = "LOW"; break;
        case TRIGGER_CONTINUOUS: mode_str = "CONTINUOUS"; break;
    }
    SCANNER_LOG("Trigger mode set to %s", mode_str);
}

void HighSpeedScannerCore::setXLUT(const uint16_t* lut256)
{
    if (!lut256) return;

    // Allocate on first upload only (keeps masters and LUT-free setups lean)
    if (!x_map_) {
        x_map_ = new (std::nothrow) uint16_t[4096];
        if (!x_map_) {
            SCANNER_LOG("ERROR: X LUT allocation failed");
            return;
        }
    }

    for (int x = 0; x < 4096; ++x) {
        int idx = (x * (SCANNER_X_LUT_N - 1) + 2047) / 4095;
        if (idx < 0) idx = 0;
        if (idx >= SCANNER_X_LUT_N) idx = SCANNER_X_LUT_N - 1;
        x_map_[x] = lut256[idx] & 0x0FFF;
    }
    x_map_valid_ = true;
    SCANNER_LOG("X LUT updated");
}

void HighSpeedScannerCore::start()
{
    SCANNER_LOG("start() called");
    frame_idx_ = 0;
    line_idx_ = 0;
    overruns_ = 0;
    config_changed_ = false;  // Clear any pending config change
    running_ = true;
    SCANNER_LOG("Scanning STARTED (frame_count=%d, 0=infinite)", config_.frame_count);
}

void HighSpeedScannerCore::stop()
{
    SCANNER_LOG("stop() called");
    running_ = false;
    config_changed_ = false;  // Clear config change flag
    setLaserGate(false);      // Never leave the laser on after a stop
    SCANNER_LOG("Scanning STOPPED");
}

ScannerStatus HighSpeedScannerCore::getStatus() const
{
    return {
        .running = running_,
        .current_line = line_idx_,
        .current_frame = frame_idx_,
        .timing_overruns = overruns_
    };
}

void HighSpeedScannerCore::buildLineProfile()
{
    const bool bidir = (config_.bidirectional != 0);
    const uint32_t ov = config_.overscan_samples;
    const uint32_t fly = bidir ? 0 : config_.fly_samples;
    uint32_t total = (uint32_t)config_.pre_samples + 2u * ov + config_.nx +
                     fly + config_.line_settle_samples;

    if (!line_x_ || total == 0 || total > SCANNER_MAX_LINE_SAMPLES) {
        line_len_ = 0;
        img_start_ = 0;
        img_end_ = 0;
        return;
    }

    // Per-pixel slope of the imaging ramp; the overscan regions continue this
    // exact slope beyond [x_min, x_max] so the mirror is at constant velocity
    // throughout the (triggered) imaging window.
    const float slope = (config_.nx > 1)
        ? (float)((int32_t)config_.x_max - (int32_t)config_.x_min) / (float)(config_.nx - 1)
        : 0.0f;
    const float start_x = (float)config_.x_min - slope * (float)ov; // ramp entry point
    const float end_x   = (float)config_.x_max + slope * (float)ov; // ramp exit point

    uint32_t k = 0;

    // ---- Forward profile: pre @ start_x | ov ramp | nx ramp | ov ramp | [fly] | settle ----
    for (uint32_t i = 0; i < config_.pre_samples; ++i) {
        line_x_[k++] = clamp12((int)(start_x + 0.5f));
    }
    for (uint32_t i = 0; i < ov; ++i) { // lead-in overscan: start_x -> x_min (exclusive)
        line_x_[k++] = clamp12((int)(start_x + slope * (float)i + 0.5f));
    }
    img_start_ = (uint16_t)k;
    if (config_.nx <= 1) {
        line_x_[k++] = config_.x_min;
    } else {
        for (uint32_t i = 0; i < config_.nx; ++i) {
            line_x_[k++] = clamp12((int)((float)config_.x_min + slope * (float)i + 0.5f));
        }
    }
    img_end_ = (uint16_t)k;
    for (uint32_t i = 1; i <= ov; ++i) { // lead-out overscan: x_max -> end_x
        line_x_[k++] = clamp12((int)((float)config_.x_max + slope * (float)i + 0.5f));
    }
    // Flyback (cosine ease from end_x back to start_x) - unidirectional only
    if (fly == 1) {
        line_x_[k++] = clamp12((int)(start_x + 0.5f));
    } else if (fly > 1) {
        for (uint32_t i = 0; i < fly; ++i) {
            float t = (float)i / (float)(fly - 1);
            float s = 0.5f - 0.5f * cosf((float)M_PI * t);
            line_x_[k++] = clamp12((int)(end_x + (start_x - end_x) * s + 0.5f));
        }
    }
    // Settle region: hold at the position the next line starts from
    // (start_x after flyback; end_x in bidirectional mode)
    const float settle_x = bidir ? end_x : start_x;
    for (uint32_t i = 0; i < config_.line_settle_samples; ++i) {
        line_x_[k++] = clamp12((int)(settle_x + 0.5f));
    }
    line_len_ = (uint16_t)k;

    // Bidirectional odd lines are mirrored on the fly in the scan loop
    // (x' = mirror_sum_ - x): same region layout and therefore the SAME
    // [img_start_, img_end_) window - triggers stay monotonic and
    // equidistant; only the direction of motion differs. The bridge/host
    // must flip odd lines when reassembling the image.
    mirror_sum_ = (int32_t)lroundf(start_x + end_x);
}

uint16_t HighSpeedScannerCore::computeY(uint16_t line) const
{
    if (config_.ny <= 1) return config_.y_min;
    int32_t dy = (int32_t)config_.y_max - (int32_t)config_.y_min;
    int32_t y = (int32_t)config_.y_min + (dy * (int32_t)line) / (int32_t)(config_.ny - 1);
    return clamp12(y);
}

