youseetoo/uc2-esp32/main/src/scanner/HighSpeedScannerCore.cpp
uint16_t HighSpeedScannerCore::applyXMap(uint16_t x) const
{
    if (!x_map_valid_ || !x_map_) return x;
    return x_map_[x & 0x0FFF];
}

void HighSpeedScannerCore::triggerPulsePixel()
{
    if (trigger_pin_pixel_ < 0) return;
    
    // Fast GPIO register access
    GPIO.out_w1ts = (1U << trigger_pin_pixel_);
    GPIO.out_w1tc = (1U << trigger_pin_pixel_);
}

void HighSpeedScannerCore::triggerPulseLine()
{
    if (trigger_pin_line_ < 0) return;
    
    GPIO.out_w1ts = (1U << trigger_pin_line_);
    esp_rom_delay_us(5);
    GPIO.out_w1tc = (1U << trigger_pin_line_);
}

void HighSpeedScannerCore::triggerPulseFrame()
{
    if (trigger_pin_frame_ < 0) return;
    
    GPIO.out_w1ts = (1U << trigger_pin_frame_);
    esp_rom_delay_us(5);
    GPIO.out_w1tc = (1U << trigger_pin_frame_);
}

void HighSpeedScannerCore::setLaserGate(bool on)
{
    if (laser_pin_ < 0) return;
    if (on) {
        GPIO.out_w1ts = (1U << laser_pin_);
    } else {
        GPIO.out_w1tc = (1U << laser_pin_);
    }
}

/**
 * Hardware pixel clock via the RMT peripheral.
 *
 * One RMT symbol encodes a full pixel cycle (high for trig_width_us, low for
 * the rest of the dwell); the peripheral loops it exactly nx times per line
 * with hardware timing, fully decoupled from the SPI/DAC software loop.
 * Requires finite TX loop count support (ESP32-S3 yes, classic ESP32 no);
 * without it the scanner falls back to software pulses.
 */
bool HighSpeedScannerCore::enableHwPixelClock()
{
#if defined(GALVO_RMT_NEW_API)
    if (hw_clock_active_) return true;
    if (trigger_pin_pixel_ < 0) return false;

    rmt_tx_channel_config_t chan_cfg = {};
    chan_cfg.gpio_num = (gpio_num_t)trigger_pin_pixel_;
    chan_cfg.clk_src = RMT_CLK_SRC_DEFAULT;
    chan_cfg.resolution_hz = 1000000; // 1 tick = 1 us
    chan_cfg.mem_block_symbols = 48;
    chan_cfg.trans_queue_depth = 2;

    rmt_channel_handle_t chan = nullptr;
    if (rmt_new_tx_channel(&chan_cfg, &chan) != ESP_OK) {
        SCANNER_LOG("ERROR: RMT channel alloc failed - using software pixel clock");
        return false;
    }
    rmt_copy_encoder_config_t enc_cfg = {};
    rmt_encoder_handle_t enc = nullptr;
    if (rmt_new_copy_encoder(&enc_cfg, &enc) != ESP_OK || rmt_enable(chan) != ESP_OK) {
        if (enc) rmt_del_encoder(enc);
        rmt_del_channel(chan);
        SCANNER_LOG("ERROR: RMT encoder/enable failed - using software pixel clock");
        return false;
    }
    rmt_chan_ = chan;
    rmt_encoder_ = enc;
    hw_clock_active_ = true;
    SCANNER_LOG("Hardware pixel clock enabled (RMT on GPIO%d)", trigger_pin_pixel_);
    return true;
#elif defined(GALVO_RMT_LEGACY_API)
    if (hw_clock_active_) return true;
    if (trigger_pin_pixel_ < 0) return false;

    rmt_config_t cfg = RMT_DEFAULT_CONFIG_TX((gpio_num_t)trigger_pin_pixel_, GALVO_RMT_CHANNEL);
    cfg.clk_div = 80;               // 80 MHz APB / 80 -> 1 tick = 1 us
    cfg.tx_config.loop_en = true;   // loop the symbol; autostop after loop count
    if (rmt_config(&cfg) != ESP_OK ||
        rmt_driver_install(GALVO_RMT_CHANNEL, 0, 0) != ESP_OK) {
        SCANNER_LOG("ERROR: RMT (legacy) init failed - using software pixel clock");
        return false;
    }
    rmt_enable_tx_loop_autostop(GALVO_RMT_CHANNEL, true);
    hw_clock_active_ = true;
    SCANNER_LOG("Hardware pixel clock enabled (legacy RMT ch%d on GPIO%d)",
                (int)GALVO_RMT_CHANNEL, trigger_pin_pixel_);
    return true;
#else
    SCANNER_LOG("Hardware pixel clock not supported on this SoC - using software pulses");
    return false;
#endif
}

void HighSpeedScannerCore::disableHwPixelClock()
{
#if defined(GALVO_RMT_NEW_API) || defined(GALVO_RMT_LEGACY_API)
    if (!hw_clock_active_) return;
#if defined(GALVO_RMT_NEW_API)
    rmt_disable((rmt_channel_handle_t)rmt_chan_);
    rmt_del_encoder((rmt_encoder_handle_t)rmt_encoder_);
    rmt_del_channel((rmt_channel_handle_t)rmt_chan_);
    rmt_chan_ = nullptr;
    rmt_encoder_ = nullptr;
#else
    rmt_tx_stop(GALVO_RMT_CHANNEL);
    rmt_driver_uninstall(GALVO_RMT_CHANNEL);
#endif
    hw_clock_active_ = false;
    // Give the pin back to the GPIO matrix for software pulses
    if (trigger_pin_pixel_ >= 0) {
        gpio_config_t io = {};
        io.intr_type = GPIO_INTR_DISABLE;
        io.mode = GPIO_MODE_OUTPUT;
        io.pin_bit_mask = (1ULL << trigger_pin_pixel_);
        gpio_config(&io);
        gpio_set_level((gpio_num_t)trigger_pin_pixel_, 0);
    }
    SCANNER_LOG("Hardware pixel clock disabled");
#endif
}

void HighSpeedScannerCore::armHwPixelClock(uint16_t count, uint16_t period_us, uint16_t width_us)
{
#if defined(GALVO_RMT_NEW_API) || defined(GALVO_RMT_LEGACY_API)
    if (!hw_clock_active_ || count == 0 || period_us == 0) return;
    // RMT symbol durations are 15-bit (max 32767 ticks @ 1 MHz)
    uint16_t w = width_us ? width_us : 1;
    if (w >= period_us) w = (period_us > 1) ? (period_us - 1) : 1;
    uint16_t low = period_us - w;
    if (w > 32767 || low > 32767) return; // dwell too long for one symbol - skip

#if defined(GALVO_RMT_NEW_API)
    rmt_symbol_word_t sym = {};
    sym.level0 = 1;
    sym.duration0 = w;
    sym.level1 = 0;
    sym.duration1 = low;

    rmt_transmit_config_t tx_cfg = {};
    tx_cfg.loop_count = count;
    // Previous line's train is guaranteed shorter than the full line period,
    // but don't block if something went wrong
    rmt_tx_wait_all_done((rmt_channel_handle_t)rmt_chan_, 0);
    rmt_transmit((rmt_channel_handle_t)rmt_chan_, (rmt_encoder_handle_t)rmt_encoder_,
                 &sym, sizeof(sym), &tx_cfg);
#else
    rmt_item32_t item;
    item.level0 = 1;
    item.duration0 = w;
    item.level1 = 0;
    item.duration1 = low;

    rmt_tx_stop(GALVO_RMT_CHANNEL); // previous train has finished (autostop)
    rmt_set_tx_loop_count(GALVO_RMT_CHANNEL, count);
    rmt_write_items(GALVO_RMT_CHANNEL, &item, 1, false);
#endif
#endif
}

void HighSpeedScannerCore::setTriggerState(bool high)
{
    if (trigger_pin_pixel_ < 0) return;
    
    // Check trigger mode priority
    TriggerMode mode;
    xSemaphoreTake(config_mutex_, portMAX_DELAY);
    mode = trigger_mode_;
    xSemaphoreGive(config_mutex_);
    
    // Manual override has highest priority
    if (mode == TRIGGER_HIGH) {
        GPIO.out_w1ts = (1U << trigger_pin_pixel_);
        return;
    }
    if (mode == TRIGGER_LOW) {
        GPIO.out_w1tc = (1U << trigger_pin_pixel_);
        return;
    }
    
    // Continuous mode: always HIGH during scan
    if (mode == TRIGGER_CONTINUOUS) {
        GPIO.out_w1ts = (1U << trigger_pin_pixel_);
        return;
    }
    
    // Auto mode: respect requested state
    if (high) {
        GPIO.out_w1ts = (1U << trigger_pin_pixel_);
    } else {
        GPIO.out_w1tc = (1U << trigger_pin_pixel_);
    }
}

void HighSpeedScannerCore::taskWrapper(void* param)
{
    HighSpeedScannerCore* scanner = static_cast<HighSpeedScannerCore*>(param);
    scanner->scannerTask();
}

bool HighSpeedScannerCore::createTask(int core_id, int priority)
{
    if (task_created_) {
        SCANNER_LOG("Task already created");
        return true;
    }

    SCANNER_LOG("Creating scanner task on core %d with priority %d", core_id, priority);
    
